Revit 2025 API
OutdoorAirFlowStandard Enumeration
 An enumerated type listing all the possible outdoor airflow standard for a space type.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum OutdoorAirFlowStandard
Public Enumeration OutdoorAirFlowStandard
public enum class OutdoorAirFlowStandard
type OutdoorAirFlowStandard
Members
Member name | Value | Description
ByPeopleAndByArea | 0 |  By people and by area.
ByACH | 1 |  By ACH.
MaxByPeople_ByArea | 2 |  Maximum(by people, by area).
MaxByACH_ByPeopleByArea | 3 |  Maximum(by ACH, by people and by area).
MaxByACH_ByArea_ByPeople | 4 |  Maximum(by ACH, by area, by people).
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace